; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_12 ?v10 ?v8)
             (pred_11 ?v2 ?v6)
             (pred_4 ?v10 ?v6)
             (pred_8 ?v9 ?v10 )
	     (pred_5 ?v10)
             (pred_9 ?v12)
             (pred_10 ?v2)
             (pred_2 ?v6)
             (pred_3 ?v10)
             (pred_6 ?v2)
             (pred_7 ?v10)
             (pred_1 ))



(:action op_4
:parameters (?v4 ?v1 ?v13 ?v3)
:precondition (and (pred_9 ?v4) (pred_9 ?v1) (pred_10 ?v13) (pred_2 ?v3)
          (pred_12 ?v4 ?v1) (pred_11 ?v13 ?v3)
                   (pred_4 ?v1 ?v3) (pred_5 ?v4) 
                   (pred_3 ?v1) (pred_6 ?v13))
:effect (and  (pred_7 ?v1) (not (pred_3 ?v1))))


(:action op_3
:parameters (?v4 ?v5)
:precondition (and (pred_9 ?v4) (pred_9 ?v5)
               (pred_5 ?v4) (pred_12 ?v4 ?v5) (pred_7 ?v5))
:effect (and (pred_5 ?v5) (not (pred_5 ?v4))))

(:action op_1
:parameters (?v4 ?v13)
:precondition (and (pred_9 ?v4) (pred_10 ?v13) 
                  (pred_5 ?v4) (pred_8 ?v13 ?v4) (pred_1 ))
:effect (and (pred_6 ?v13)
   (not (pred_8 ?v13 ?v4)) (not (pred_1 ))))


(:action op_2
:parameters (?v4 ?v7 ?v11)
:precondition (and (pred_9 ?v4) (pred_10 ?v7) (pred_10 ?v11)
                  (pred_5 ?v4) (pred_6 ?v11) (pred_8 ?v7 ?v4))
:effect (and (pred_6 ?v7) (pred_8 ?v11 ?v4)
        (not (pred_6 ?v11)) (not (pred_8 ?v7 ?v4))))

(:action op_5
:parameters (?v4 ?v13)
:precondition (and (pred_9 ?v4) (pred_10 ?v13) 
                  (pred_5 ?v4) (pred_6 ?v13))
:effect (and (pred_1 ) (pred_8 ?v13 ?v4) (not (pred_6 ?v13)))))

; problem
(define (problem grid-3-3-2-2-2)
    (:domain grid)
    (:objects
    obj_04 obj_10 obj_12 obj_01 obj_06 obj_11 obj_09 obj_08 obj_05
    obj_13 obj_03
    obj_02 obj_07
    )

    (:init
       (pred_1)

       (pred_9 obj_04)
       (pred_9 obj_10)
       (pred_9 obj_12)
       (pred_9 obj_01)
       (pred_9 obj_06)
       (pred_9 obj_11)
       (pred_9 obj_09)
       (pred_9 obj_08)
       (pred_9 obj_05)
       (pred_2 obj_13)
       (pred_2 obj_03)
       (pred_10 obj_02)
       (pred_10 obj_07)

       (pred_12 obj_04 obj_01)
       (pred_12 obj_04 obj_10)
       (pred_12 obj_10 obj_06)
       (pred_12 obj_10 obj_12)
       (pred_12 obj_10 obj_04)
       (pred_12 obj_12 obj_11)
       (pred_12 obj_12 obj_10)
       (pred_12 obj_01 obj_09)
       (pred_12 obj_01 obj_06)
       (pred_12 obj_01 obj_04)
       (pred_12 obj_06 obj_08)
       (pred_12 obj_06 obj_11)
       (pred_12 obj_06 obj_10)
       (pred_12 obj_06 obj_01)
       (pred_12 obj_11 obj_05)
       (pred_12 obj_11 obj_12)
       (pred_12 obj_11 obj_06)
       (pred_12 obj_09 obj_08)
       (pred_12 obj_09 obj_01)
       (pred_12 obj_08 obj_05)
       (pred_12 obj_08 obj_06)
       (pred_12 obj_08 obj_09)
       (pred_12 obj_05 obj_11)
       (pred_12 obj_05 obj_08)
       (pred_3 obj_11)
       (pred_3 obj_12)
       (pred_4  obj_11 obj_13)
       (pred_4  obj_12 obj_03)
       (pred_7 obj_04)
       (pred_7 obj_10)
       (pred_7 obj_01)
       (pred_7 obj_06)
       (pred_7 obj_09)
       (pred_7 obj_08)
       (pred_7 obj_05)

       (pred_11  obj_02 obj_13)
       (pred_11  obj_07 obj_03)
       (pred_8 obj_02 obj_10)
       (pred_8 obj_07 obj_08)
       (pred_5 obj_09)
    )

    (:goal (and
       (pred_8 obj_02 obj_05)
    ))
(:constraints
  (always (not (pred_5 obj_06)))
)
)

; plan
1. (op_3 obj_09 obj_01)
   deleted: (pred_5 obj_09)
   added: (pred_5 obj_01)
   goals met: 0 of 1
2. (op_3 obj_01 obj_04)
   deleted: (pred_5 obj_01)
   added: (pred_5 obj_04)
   goals met: 0 of 1
3. (op_3 obj_04 obj_10)
   deleted: (pred_5 obj_04)
   added: (pred_5 obj_10)
   goals met: 0 of 1
4. (op_1 obj_10 obj_02)
   deleted: (pred_8 obj_02 obj_10) (pred_1)
   added: (pred_6 obj_02)
   goals met: 0 of 1
5. (op_3 obj_10 obj_04)
   deleted: (pred_5 obj_10)
   added: (pred_5 obj_04)
   goals met: 0 of 1
6. (op_3 obj_04 obj_01)
   deleted: (pred_5 obj_04)
   added: (pred_5 obj_01)
   goals met: 0 of 1
7. (op_3 obj_01 obj_09)
   deleted: (pred_5 obj_01)
   added: (pred_5 obj_09)
   goals met: 0 of 1
8. (op_3 obj_09 obj_08)
   deleted: (pred_5 obj_09)
   added: (pred_5 obj_08)
   goals met: 0 of 1
9. (op_3 obj_08 obj_05)
   deleted: (pred_5 obj_08)
   added: (pred_5 obj_05)
   goals met: 0 of 1
10. (op_5 obj_05 obj_02)
   deleted: (pred_6 obj_02)
   added: (pred_1) (pred_8 obj_02 obj_05)
   goals met: 1 of 1
